m_start = '''
    Что будете делать с сотрудниками?.\n 
    Выбирайте...'''

#Первое_Меню
m_type = '''
    1. Показать всех сотрудников
    2. Найти сотрудника
    3. Сделать выборку сотрудников по должности
    4. Сделать выборку сотрудников по зарплате
    5. Добравить сотрудника
    6. Удалить сотрудника
    7. Обновить данные сотрудника
    8. Экспортировать  данные в формат .json
    9. Экспортировать данные в формат .csv
    10. Закончить работу
    Введите номер операции:'''
#Первое_Меню
m_num_sol = '''
    1. Зарплата сотрудника не превышает 30000 руб
    2. Зарплата сотрудников больше 30000, но меньше 50000 руб
    3. Зарплата сотрудников больше 50000 руб
    4. Закончить работу'''






#Вспомогательное
m_name = 'Введите имя сотрудника для изменения данных: '
m_phone = 'Введите номер телефона: '
m_find = 'Введите имя контакта для поиска: '
m_dell = 'Введите имя контакта для удаления: '
m_append = 'Контакт добавлен'
m_dell_cont = 'Контакт удален'
m_all = 'Сотрудники компании: '
m_non = 'Указанный контакт отсутствует.'
m_num_oper = 'Введите номер операции: '
m_non_z = 'Сотрудников с такой зарплатой не найдено'
m_update = 'Внимание!!! Этот сотрудник будет удален. Необходимо будет внести новые данные сотрудника. Введите повторно имя сотрудника для удаления'
m_new = 'Введите обновленные данные сотрудника'

#ТаблицаБД
m_id = 'Номер сотрудника: '
m_first_name = 'Имя сотрудника: '
m_last_name = 'Фамилия сотрудника: '
m_position = 'Должность сотрудника: '
m_phone_number = 'Телефон сотрудника: '
m_salary = 'Заработная плата сотрудника: '


