m_start = '''
    Это простой телефонный справочник с 
    возможностью добавления, удаления и 
    демонстрации контактов.\n 
    C каким файлом будем работать?'''
m_type = '''
    1. Работать с .csv
    2. Работать с .txt
    3. Закрыть телефонный справочник
    Введите номер операции:'''
m_func = '''
    1. Добавить контакт
    2. Найти контакт
    3. Удалить контакт
    4. Показать имеющиеся контакты
    5. Закрыть телефонный справочник
    Введите номер операции: '''

m_name = 'Введите имя контакта: '
m_phone = 'Введите номер телефона: '
m_find = 'Введите имя контакта для поиска: '
m_dell = 'Введите имя контакта для удаления: '
m_append = 'Контакт добавлен'
m_dell_cont = 'Контакт удален'
m_all = 'Ваши контакты: '
m_non = 'Указанный контакт отсутствует.'