#Вычислить число c заданной точностью d
#Пример:
#- при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$   math.pi - pi = 3,1415926...

import math 

d = input('Введите точность округления числа ПИ (формат 0.001): ')
d = d[2:len(d)]
print(round(math.pi,len(d)))